In [13]:
import pandas as pd

In [14]:
df = pd.read_csv('income.csv')

In [15]:
df

   account_id    income
0         3.0  108939.0
1         2.0   12747.0
2         8.0   87709.0
3         6.0   91796.0
4         NaN       NaN

In [16]:
df.dropna(inplace=True)

In [17]:
df

   account_id    income
0         3.0  108939.0
1         2.0   12747.0
2         8.0   87709.0
3         6.0   91796.0

In [20]:
df['category'] = df['income'].apply(
    lambda x: "Low Salary" if x < 20000 else ("High Salary" if x > 50000 else "Average Salary")
)

In [22]:
df

   account_id    income     category
0         3.0  108939.0  High Salary
1         2.0   12747.0   Low Salary
2         8.0   87709.0  High Salary
3         6.0   91796.0  High Salary

In [33]:
result = df.groupby('category').size().reset_index(name='accounts_count')

In [34]:
result

      category  accounts_count
0  High Salary               3
1   Low Salary               1

In [37]:
all_categories = pd.DataFrame({'category': ['Low Salary', 'Average Salary', 'High Salary']})

In [39]:
result = pd.merge(all_categories, result, on='category', how='left').fillna(0)

In [40]:
result

         category  accounts_count
0      Low Salary             1.0
1  Average Salary             0.0
2     High Salary             3.0